{
  // License to activate the IT Hit User File System Engine.
  // Set the license content directly as value. Make sure to escape quotes: \":
  // "UserFileSystemLicense": "<?xml version=\"1.0\" encoding=\"utf-8\"?><License...

  // If no license is specified, the Engine will be activated
  // automatically via internet and will function for 5 days. The Engine will stop working after that.
  // To enable a 1-month trial period, download a trial license here: https://userfilesystem.com/download/
  "UserFileSystemLicense": "",

  // License to activate the IT Hit WebDAV Client Library for .NET. 
  // Set the license content directly as value. Make sure to escape quotes: \":
  // "WebDAVClientLicense": "<?xml version=\"1.0\" encoding=\"utf-8\"?><License...

  // If no license is specified, the Library will be activated
  // automatically via internet and will function for 5 days. The Library will stop working after that.
  // To enable a 1-month trial period, download a trial license here: https://www.webdavsystem.com/client/download/
  "WebDAVClientLicense": "",

  // Your WebDAV server URL.
  // In case this parameter is empty, the dialog to specify the server URL will be displayed during first start. 
  // In this case, the URL is saved in the registry under the HKEY_CURRENT_USER\SOFTWARE\<AppID> key.

  // For testing and demo purposes you can use IT Hit demo servers. Navigate to https://webdavserver.net or 
  // https://webdavserver.com in a web browser. Copy the URL or your test folder, that looks like 
  // https://webdavserver.net/User123456/ and specify it below.
  "WebDAVServerUrl": "https://server/",

  // Your WebSocket server URL. 
  // In case of IT Hit demo servers specify server root: wss://webdavserver.net or wss://webdavserver.com
  "WebSocketServerUrl": "wss://server/",

  // URL to get a thumbnail for OS file manager thumbnails mode.
  // Your server must return 404 Not Found if the thumbnail can not be generated.
  // If incorrect size is returned, the image will be resized by the platform automatically.
  "ThumbnailGeneratorUrl": "{path to file}?width={thumbnail width}&height={thumbnail height}",

  // File types to request thumbnails for.
  // To request thumbnails for specific file types, list file types using '|' separator.
  // To request thumbnails for all file types set the value to "*".
  "RequestThumbnailsFor": "png|jpeg|gif|jpg|apng|avif|jfif|pjpeg|pjp|svg|webp|bmp|ico|cur|tif|tiff|heic|hif",

  // Automatic lock timout in milliseconds. Automatic lock will be extended (refreshed) when this period is about to expire.
  // This type of lock is set when Microsoft Office or AutoCAD application opens a document.
  "AutoLockTimoutMs": 20000,

  // Manual lock timout in milliseconds. Manual lock is set via context menu and is not extended. Set to -1 for infinity.
  // Note that many WebDAV servers do not accept Infinity and will set its own default timeout instead.
  "ManualLockTimoutMs": -1,

  // Automatically lock the file in remote storage when a file handle is being opened for writing, unlock on close.
  "AutoLock": false
}